rs-programmer/stm32h743vit6/Middlewares/Third_Party/USB/Device/Class/CDC/Src/usbd_cdc_if.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : usbd_cdc_if.c
 * @version        : v1.0_Cube
 * @brief          : Usb device for Virtual Com Port.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "usbd_cdc_if.h"
#include "cmsis_os2.h"
#include "stm32h743xx.h"

/* USER CODE BEGIN INCLUDE */

/* USER CODE END INCLUDE */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/** @addtogroup STM32_USB_OTG_DEVICE_LIBRARY
 * @brief Usb device library.
 * @{
 */

/** @addtogroup USBD_CDC_IF
 * @{
 */

/** @defgroup USBD_CDC_IF_Private_TypesDefinitions USBD_CDC_IF_Private_TypesDefinitions
 * @brief Private types.
 * @{
 */

/* USER CODE BEGIN PRIVATE_TYPES */

/* USER CODE END PRIVATE_TYPES */

/**
 * @}
 */

/** @defgroup USBD_CDC_IF_Private_Defines USBD_CDC_IF_Private_Defines
 * @brief Private defines.
 * @{
 */

/* USER CODE BEGIN PRIVATE_DEFINES */
/* USER CODE END PRIVATE_DEFINES */

/**
 * @}
 */

/** @defgroup USBD_CDC_IF_Private_Macros USBD_CDC_IF_Private_Macros
 * @brief Private macros.
 * @{
 */

/* USER CODE BEGIN PRIVATE_MACRO */
#define USBD_TX_MAX_BYTES (10 * 1024)
#define USBD_RX_MAX_BYTES (10 * 1024)

/* USER CODE END PRIVATE_MACRO */

/**
 * @}
 */

/** @defgroup USBD_CDC_IF_Private_Variables USBD_CDC_IF_Private_Variables
 * @brief Private variables.
 * @{
 */
/* Create buffer for reception and transmission           */
/* It's up to user to redefine and/or remove those define */
/** Received data over USB are stored in this buffer      */
__RAM_DMA uint8_t UserRxBufferFS[APP_RX_DATA_SIZE];

/** Data to send over USB CDC are stored in this buffer   */
__RAM_DMA uint8_t UserTxBufferFS[APP_TX_DATA_SIZE];

/* USER CODE BEGIN PRIVATE_VARIABLES */

/* USER CODE END PRIVATE_VARIABLES */

/**
 * @}
 */

/** @defgroup USBD_CDC_IF_Exported_Variables USBD_CDC_IF_Exported_Variables
 * @brief Public variables.
 * @{
 */

extern USBD_HandleTypeDef hUsbDeviceFS;

/* USER CODE BEGIN EXPORTED_VARIABLES */

/* USER CODE END EXPORTED_VARIABLES */

/**
 * @}
 */

/** @defgroup USBD_CDC_IF_Private_FunctionPrototypes USBD_CDC_IF_Private_FunctionPrototypes
 * @brief Private functions declaration.
 * @{
 */

static int8_t CDC_Init_FS(void);
static int8_t CDC_DeInit_FS(void);
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t *pbuf, uint16_t length);
static int8_t CDC_Receive_FS(uint8_t *pbuf, uint32_t *Len);
static int8_t CDC_TransmitCplt_FS(uint8_t *pbuf, uint32_t *Len, uint8_t epnum);

/* USER CODE BEGIN PRIVATE_FUNCTIONS_DECLARATION */
osSemaphoreId_t Semaphore_TransmitCplt;
osSemaphoreId_t Semaphore_ReceiveCplt;
uint32_t UserRxLength = 0;
uint32_t UserRxTotalLength = 0;
uint32_t UserTxLength = 0;
uint32_t UserTxTotalLength = 0;

/* USER CODE END PRIVATE_FUNCTIONS_DECLARATION */

/**
 * @}
 */

USBD_CDC_ItfTypeDef USBD_Interface_fops_FS = {
    CDC_Init_FS,
    CDC_DeInit_FS,
    CDC_Control_FS,
    CDC_Receive_FS,
    CDC_TransmitCplt_FS,
};

/* Private functions ---------------------------------------------------------*/
/**
 * @brief  Initializes the CDC media low layer over the FS USB IP
 * @retval USBD_OK if all operations are OK else USBD_FAIL
 */
static int8_t CDC_Init_FS(void) {
    /* USER CODE BEGIN 3 */
    /* Set Application Buffers */
    USBD_CDC_SetTxBuffer(&hUsbDeviceFS, UserTxBufferFS, 0);
    USBD_CDC_SetRxBuffer(&hUsbDeviceFS, UserRxBufferFS);
    return (USBD_OK);
    /* USER CODE END 3 */
}

/**
 * @brief  DeInitializes the CDC media low layer
 * @retval USBD_OK if all operations are OK else USBD_FAIL
 */
static int8_t CDC_DeInit_FS(void) {
    /* USER CODE BEGIN 4 */
    if (Semaphore_TransmitCplt != NULL) {
        osSemaphoreDelete(Semaphore_TransmitCplt);
        Semaphore_TransmitCplt = NULL;
    }

    if (Semaphore_ReceiveCplt != NULL) {
        osSemaphoreDelete(Semaphore_ReceiveCplt);
        Semaphore_ReceiveCplt = NULL;
    }
    return (USBD_OK);
    /* USER CODE END 4 */
}

/**
 * @brief  Manage the CDC class requests
 * @param  cmd: Command code
 * @param  pbuf: Buffer containing command data (request parameters)
 * @param  length: Number of data to be sent (in bytes)
 * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
 */
static int8_t CDC_Control_FS(uint8_t cmd, uint8_t *pbuf, uint16_t length) {
    /* USER CODE BEGIN 5 */
    switch (cmd) {
    case CDC_SEND_ENCAPSULATED_COMMAND:

        break;

    case CDC_GET_ENCAPSULATED_RESPONSE:

        break;

    case CDC_SET_COMM_FEATURE:

        break;

    case CDC_GET_COMM_FEATURE:

        break;

    case CDC_CLEAR_COMM_FEATURE:

        break;

        /*******************************************************************************/
        /* Line Coding Structure                                                       */
        /*-----------------------------------------------------------------------------*/
        /* Offset | Field       | Size | Value  | Description                          */
        /* 0      | dwDTERate   |   4  | Number |Data terminal rate, in bits per second*/
        /* 4      | bCharFormat |   1  | Number | Stop bits                            */
        /*                                        0 - 1 Stop bit                       */
        /*                                        1 - 1.5 Stop bits                    */
        /*                                        2 - 2 Stop bits                      */
        /* 5      | bParityType |  1   | Number | Parity                               */
        /*                                        0 - None                             */
        /*                                        1 - Odd                              */
        /*                                        2 - Even                             */
        /*                                        3 - Mark                             */
        /*                                        4 - Space                            */
        /* 6      | bDataBits  |   1   | Number Data bits (5, 6, 7, 8 or 16).          */
        /*******************************************************************************/
    case CDC_SET_LINE_CODING:

        break;

    case CDC_GET_LINE_CODING:

        break;

    case CDC_SET_CONTROL_LINE_STATE:

        break;

    case CDC_SEND_BREAK:

        break;

    default:
        break;
    }

    return (USBD_OK);
    /* USER CODE END 5 */
}

/**
 * @brief  Data received over USB OUT endpoint are sent over CDC interface
 *         through this function.
 *
 *         @note
 *         This function will issue a NAK packet on any OUT packet received on
 *         USB endpoint until exiting this function. If you exit this function
 *         before transfer is complete on CDC interface (ie. using DMA controller)
 *         it will result in receiving more data while previous ones are still
 *         not sent.
 *
 * @param  Buf: Buffer of data to be received
 * @param  Len: Number of data received (in bytes)
 * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
 */
static int8_t CDC_Receive_FS(uint8_t *Buf, uint32_t *Len) {
    /* USER CODE BEGIN 6 */
    USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;

    if (UserRxTotalLength >= *Len) {
        UserRxTotalLength -= *Len;
    } else {
        UserRxTotalLength = 0;
    }

    UserRxLength += *Len;

    if (UserRxTotalLength > 0) {
        hcdc->RxState = 1;
        uint8_t *temp_buf = (uint32_t)hcdc->RxBuffer + UserRxLength;
        uint32_t temp_len = MIN(UserRxTotalLength, USBD_RX_MAX_BYTES);
        hcdc->RxLength = temp_len;
        USBD_CDC_SetRxBuffer(&hUsbDeviceFS, temp_buf);
        USBD_CDC_ReceivePacket(&hUsbDeviceFS);
    } else {
        osSemaphoreRelease(Semaphore_ReceiveCplt);
        hcdc->RxState = 0;
    }

    return (USBD_OK);
    /* USER CODE END 6 */
}

/**
 * @brief  CDC_Transmit_FS
 *         Data to send over USB IN endpoint are sent over CDC interface
 *         through this function.
 *         @note
 *
 *
 * @param  Buf: Buffer of data to be sent
 * @param  Len: Number of data to be sent (in bytes)
 * @retval USBD_OK if all operations are OK else USBD_FAIL or USBD_BUSY
 */
uint8_t CDC_Transmit_FS(uint8_t *Buf, uint16_t Len) {
    uint8_t result = USBD_OK;
    /* USER CODE BEGIN 7 */
    USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;
    if (hcdc->TxState != 0) {
        return USBD_BUSY;
    }
    USBD_CDC_SetTxBuffer(&hUsbDeviceFS, Buf, Len);
    result = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
    /* USER CODE END 7 */
    return result;
}

/**
 * @brief  CDC_TransmitCplt_FS
 *         Data transmitted callback
 *
 *         @note
 *         This function is IN transfer complete callback used to inform user that
 *         the submitted Data is successfully sent over USB.
 *
 * @param  Buf: Buffer of data to be received
 * @param  Len: Number of data received (in bytes)
 * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
 */
static int8_t CDC_TransmitCplt_FS(uint8_t *Buf, uint32_t *Len, uint8_t epnum) {
    uint8_t result = USBD_OK;
    USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;

    if (UserTxTotalLength >= *Len) {
        UserTxTotalLength -= *Len;
    } else {
        UserTxTotalLength = 0;
    }

    UserTxLength += *Len;
    if (UserTxTotalLength > 0) {
        hcdc->TxState = 1;
        uint8_t *temp_buf = (uint32_t)hcdc->TxBuffer + UserTxLength;
        uint32_t temp_len = MIN(UserTxTotalLength, USBD_TX_MAX_BYTES);
        USBD_CDC_SetTxBuffer(&hUsbDeviceFS, temp_buf, temp_len);
        result = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
    } else {
        hcdc->TxState = 0;
        osSemaphoreRelease(Semaphore_TransmitCplt);
    }

    return result;
}

/* USER CODE BEGIN PRIVATE_FUNCTIONS_IMPLEMENTATION */
HAL_StatusTypeDef MX_USBD_CDC_Transmit(uint8_t *Buf, uint16_t Len, uint32_t Timeout) {
    HAL_StatusTypeDef ret = HAL_OK;

    USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;
    if ((Len == 0) || (hcdc->TxState != 0) || (hUsbDeviceFS.dev_state != USBD_STATE_CONFIGURED)) {
        return USBD_BUSY;
    }

    if (Buf == NULL) {
        Buf = UserTxBufferFS;
    }

    UserTxLength = 0;
    UserTxTotalLength = Len; /* 想要发送数据的总大小 */
    SCB_CleanDCache_by_Addr((uint32_t *)Buf, Len);

    Len = MIN(Len, USBD_TX_MAX_BYTES);
    ret = USBD_CDC_SetTxBuffer(&hUsbDeviceFS, Buf, Len);
    assert_param(ret == USBD_OK);
    ret = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
    assert_param(ret == USBD_OK);
    hcdc->TxState = 1;

    if (osSemaphoreAcquire(Semaphore_TransmitCplt, Timeout) != osOK) {
        ret = HAL_TIMEOUT;
    }

    return ret;
}

HAL_StatusTypeDef MX_USBD_CDC_Receive(uint8_t *Buf, uint16_t Len, uint32_t Timeout) {
    HAL_StatusTypeDef ret = HAL_OK;

    USBD_CDC_HandleTypeDef *hcdc = (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;
    if ((Len == 0) || (hcdc->RxState != 0) || (hUsbDeviceFS.dev_state != USBD_STATE_CONFIGURED)) {
        return USBD_BUSY;
    }

    if (Buf == NULL) {
        Buf = UserRxBufferFS;
    }

    hcdc->RxState = 1;
    UserRxLength = 0;
    UserRxTotalLength = Len; /* 想要接收数据的总大小 */
    ret = USBD_CDC_SetRxBuffer(&hUsbDeviceFS, &Buf[0]);
    assert_param(ret == USBD_OK);

    Len = MIN(Len, USBD_RX_MAX_BYTES);
    hcdc->RxLength = Len;
    ret = USBD_CDC_ReceivePacket(&hUsbDeviceFS);
    assert_param(ret == USBD_OK);

    ret = osSemaphoreAcquire(Semaphore_ReceiveCplt, Timeout);
    if (ret == osOK) {
        SCB_InvalidateDCache_by_Addr((uint32_t *)Buf, Len);
    }
    return ret;
}
/* USER CODE END PRIVATE_FUNCTIONS_IMPLEMENTATION */

/**
 * @}
 */

/**
 * @}
 */
